{"text": "Angular 2 has reached Beta and appears poised to become the hot new framework of 2016. It’s time for a showdown. Let’s see how it stacks up against 2015’s darling: React. Disclaimer: I enjoyed working in Angular 1 but switched to React in 2015. I just published a Pluralsight course on React and Flux (free trial). So yes, I’m biased. But I’m attacking both sides. Alright, let’s do this. There will be blood. Angular 2 has reached Beta and appears poised to become the hot new framework of 2016. It’s time for a showdown. Let’s see how it stacks up against 2015’s darling: React. Disclaimer: I enjoyed working in Angular 1 but switched to React in 2015. I’ve published Pluralsight courses on React and Flux and React and Redux in ES6 (free trial). So yes, I’m biased. But I’m attacking both sides. Alright, let’s do this. There will be blood. You’re Comparing Apples and Orangutans! Sigh. Yes, Angular is a framework, React is a library. Some say this difference makes comparing them illogical. Not at all! Choosing between Angular and React is like choosing between buying an off-the-shelf computer and building your own with off-the-shelf parts. This post considers the merits of these two approaches. I compare React’s syntax and component model to Angular’s syntax and component model. This is like comparing an off-the-shelf computer’s CPU to a raw CPU. Apples to apples. Angular 2 Advantages Let’s start by considering Angular 2’s advantages over React. Low Decision Fatigue Since Angular is a framework, it provides significantly more opinions and functionality out of the box. With React, you typically pull a number of other libraries off the shelf to build a real app. You’ll likely want libraries for routing, enforcing unidirectional flows, web API calls, testing, dependency management, and so on. The number of decisions is pretty overwhelming. This is why React has so many starter kits (I’ve published two). Angular offers more opinions out of the box, which helps you get started more quickly without feeling intimidated by decisions. This enforced consistency also helps new hires feel at home more quickly and makes switching developers between teams more practical. I admire how the Angular core team has embraced TypeScript, which leads to the next advantage… TypeScript = Clear Path Sure, TypeScript isn’t loved by all, but Angular 2’s opinionated take on which flavor of JavaScript to use is a big win. React examples across the web are frustratingly inconsistent — it’s presented in ES5 and ES6 in roughly equal numbers, and it currently offers three different ways to declare components. This creates confusion for newcomers. (Angular also embraces decorators instead of extends — many would consider this a plus as well). While Angular 2 doesn’t require TypeScript, the Angular core team certainly embraces it and defaults to using TypeScript in documentation. This means related examples and open source projects are more likely to feel familiar and consistent. Angular already provides clear examples that show how to utilize the TypeScript compiler. (though admittedly, not everyone is embracing TypeScript yet, but I suspect shortly after launch it’ll become the de facto standard). This consistency should help avoid the confusion and decision overload that comes with getting started with React. Reduced Churn 2015 was the year of JavaScript fatigue. Although React itself is expected to be quite stable with version 15 coming soon, React’s ecosystem has churned at a rapid pace, particularly around the long list of Flux flavors and routing. So anything you write in React today may feel out of date or require breaking changes in the future if you lean on one of many related libraries. In contrast, Angular 2 is a careful, methodical reinvention of a mature, comprehensive framework. So Angular is less likely to churn in painful ways after release. And as a full framework, when you choose Angular, you can trust a single team to make careful decisions about the future. In React, it’s your responsibility to herd a bunch of disparate, fast-moving, open-source libraries into a comprehensive whole that plays well together. It’s time-consuming, frustrating, and a never-ending job. Broad Tooling Support As you’ll see below, I consider React’s JSX a big win. However, you need to select tooling that supports JSX. React has become so popular that tooling support is rarely a problem today, but new tooling such as IDEs and linters are unlikely to support JSX on day one. Angular 2’s templates store markup in a string or in separate HTML files, so it doesn’t require special tooling support (though it appears tooling to intelligently parse Angular’s string templates is on the way). Web Component Friendly Angular 2’s design embraces the web component’s standard. Sheesh, I’m embarrassed I forgot to mention this initially — I recently published a course on web components! In short, the components that you build in Angular 2 should be much easier to convert into plain, native web components than React’s components. Sure, browser support is still weak, but this could be a big win in the long-term. Angular’s approach comes with its own set of gotchas, which is a good segue for discussing React’s advantages… React Advantages Alright, let’s consider what sets React apart. JSX JSX is an HTML-like syntax that compiles down to JavaScript. Markup and code are composed in the same file. This means code completion gives you a hand as you type references to your component’s functions and variables. In contrast, Angular’s string-based templates come with the usual downsides: No code coloring in many editors, limited code completion support, and run-time failures. You’d normally expect poor error messaging as well, but the Angular team created their own HTML parser to fix that. (Bravo!) If you don’t like Angular string-based templates, you can move the templates to a separate file, but then you’re back to what I call “the old days:” wiring the two files together in your head, with no code completion support or compile-time checking to assist. That doesn’t seem like a big deal until you’ve enjoyed life in React. Composing components in a single compile-time checked file is one of the big reasons JSX is so special. For more on why JSX is such a big win, see JSX: The Other Side of the Coin. React Fails Fast and Explicitly When you make a typo in React’s JSX, it won’t compile. That’s a beautiful thing. It means you know immediately exactly which line has an error. It tells you immediately when you forget to close a tag or reference a property that doesn’t exist. In fact, the JSX compiler specifies the line number where the typo occurred. This behavior radically speeds development. In contrast, when you mistype a variable reference in Angular 2, nothing happens at all. Angular 2 fails quietly at run time instead of compile-time. It fails slowly. I load the app and wonder why my data isn’t displaying. Not fun. React is JavaScript-Centric Here it is. This is the fundamental difference between React and Angular. Unfortunately, Angular 2 remains HTML-centric rather than JavaScript-centric. Angular 2 failed to solve its most fundamental design problem: Angular 2 continues to put “JS” into HTML. React puts “HTML” into JS. I can’t emphasize the impact of this schism enough. It fundamentally impacts the development experience. Angular’s HTML-centric design remains its greatest weakness. As I cover in “JSX: The Other Side of the Coin”, JavaScript is far more powerful than HTML. Thus, it’s more logical to enhance JavaScript to support markup than to enhance HTML to support logic. HTML and JavaScript need to be glued together somehow, and React’s JavaScript-centric approach is fundamentally superior to Angular, Ember, and Knockout’s HTML-centric approach. Here’s why… React’s JavaScript-centric design = simplicity Angular 2 continues Angular 1’s approach of trying to make HTML more powerful. So you have to utilize Angular 2’s unique syntax for simple tasks like looping and conditionals. For example, Angular 2 offers both one and two way binding via two syntaxes that are unfortunately quite different: {{myVar}} //One-way binding ngModel=\"myVar\" //Two-way binding In React, binding markup doesn’t change based on this decision (it’s handled elsewhere, as I’d argue it should be). In either case, it looks like this: {myVar} Angular 2 supports inline master templates using this syntax:", "id": "<urn:uuid:b4dd1e12-c924-4e84-acfb-e3d9894b0ffa>", "metadata": {"dump": "CC-MAIN-2023-23", "url": "http://www.bitnative.com/2016/01/04/angular-2-versus-react/", "date": "2023-05-27T23:18:42Z", "file_path": "/root/dataclean/data/CC-MAIN-2023-23/segments/CC-MAIN-20230527223515-20230528013515-00000.warc.gz", "language": "en", "language_score": 0.9108889102935791, "token_count": 3354}}
{"text": "White Hat On-Page SEO Practices described in simple infographic! 4.5/5 (2)\nWhite hat on-page SEO practices like URL Optimization, Keywords Optimization, Sitewide Optimization, Article content structuring, Human Relevance Content Model, Organic CTR are in the focus of this article. On-Page SEO is the stepping stone for any business to mark their internet presence. Along with Off-Page SEO it holds the pivotal key to penetrate straight to right audience. ‘Google incorporates in hundreds SEO practices to accumulate your efforts in their search listing. Chuck Price cites that\n“Knowing which factors carry the most weight and optimizing accordingly can be the difference between success and failure.”\nSearch Engine Algorithms continue to grow smarter; thence using white SEO techniques is the standardized way to stay ahead of the curve. Keyword stuffing, hidden text, unrelated keywords, page swapping, doorway pages, link schemes and rich snippet markup spamming kind of black tactics can penalize you severely. We shall be covering on Black Hat SEO and White Hat Off Page SEO in another article, here our prime focus is on On-Page SEO Updated Practices most used in 2017.\nThis simple to the point ‘infographic’ throws a glance on what we are simmering in details at this occasion.\nNow let’s discuss the above White Hat SEO Infographic in details:\nVery first point of attention is that these On-Page SEO practices are applicable for all devices such as desktop, laptop, mobile and tablets.\nGet your HTML > Tags Straighten:\n- Title Tag Optimization: This is how HTML of a title tag looks like\nMarketing Orbits. ‘Title’ ascribes the prima-facie of an article on all display platforms like SERP (Search Engine Result Page), Web Browser or Social Media Sharing. It gives an identity to the article just like a name to a noun. A discretely described Title with strategically placed keywords and modifier words packed in definite word length win you the most of battle.\nKeywords should be chosen as per AdWords recommendations along with clear intent of your article in particular and business as a whole should equally be reflected. Moz.com says that 90% of title display properly if built in range of 50 to 60 characters. Bruce Clay further encircles length of title in 9 words or 70 characters including spaces. Title should neither be too lengthy nor too short and properly categorized in this pattern, “Primary Keyword – Secondary Keyword | Brand Name”.\nAdding up of modifier words like best, guide, review etc. (as per requirement only) make the title more appealing and compelling.\n- Meta Data/Tag Optimization:Meta Description: Michiel at Yoast.com describes Meta description as“The Meta description is a ~160 character snippet, a tag in HTML that summarizes a page’s content.”It is the concise summary of a webpage shown by Search Engines in search results under Title and URL, just like in above image. While describing it concretely Bruce Clay goes in more depth and says that it should ideally be of 24 words or 156 characters including spaces. Description is an alternative ‘ad copy’, so should be framed strategically. It should have rich content smeared in call-to-action keywords so that the maximum of a reader’s interest could be availed.\nKeyword Optimization: Planning, researching, analyzing, selecting and enlisting in meta description HTML tag; the reasonably best words or phrases for your business is all about Keyword Optimization. Another and equally crucial aspect of Keywords Optimization goes with using them in Title Tag, Links (Internal, Inbound, Breadcrumb, Navigational), Meta Description, Page/Article Content, Headings, Images, Alt Text and URLs formation. But it shouldn’t mean a useless overcrowding of keywords, which in language of Black Hat SEO practices is termed as Keyword Stuffing.\n- Heading Tags – h1: Unlike Title and Meta Tags, Heading Tags appear on page visible to reader itself. As per my experience cosmetically beautified articles with clear paragraphs, sections, content, multi-media and citations always impress the reader. And here is where Heading Tags play pivotal role to give eye-catching touch to your write-up from its very start. As per Neil Patel of neilpatel.com “H1s are usually the most visually notable content on the page. Why not? Because it’s more about the user than about the technical optimization of the page, right?”Also as talked above in Keyword Optimization section, H1 Tag is big strategic opportunity to use natural long-tail keywords (of course with no push or stuffing) so use most prompting words as much as possible in it. Ideal length of H1 tag should be of 20 to 70 characters.\nURL Optimization & Management:\nThe work which a zipcode written in address of a letter does, similar a URL (Uninform Resource Locator) of a website or webpage does. A zipcode gives information about its territory to the postman, so does a URL to a Search Engine further to fetch or not it against the user query as exact or near to exact match.\nLeverage SEO Friendly URL Structure & Content: To strengthen the chances of being favourite fetch of a Search Engine, it is imperative to write a sophistic, simple and readable URL. As per Google recommendations a URL should leverage a SEO friendly structure ideally of 3 to 5 words in length. It should contain the prime-most keywords of your business, profession. Title or Heading of your webpage can be the best source of selecting keywords to put in URL. But same time refrain from keywords stuffing in URL as it may blacklist you.\nUse Static URLs instead of Dynamic: As the above image elaborates, use static URLs instead of dynamically generated, coded with fussy content or awkwardly long URLs. Use of stop words like a, an, the, but, of, and etc. make unnecessary repulsion for both search engines and readers hence refraining their use is always good decision.\nDelete duplicate URLs: If there exists two very similar (duplicate) content pages without reason, it shall hamper your content’s overall ranking by distributing it on two. In order to how to come over this problem, Moz presents in their article some technical aspects to be considered for attaining a respectable place for your URL in fetching such as use a 301 redirect or rel=”canonical” to unify duplicates on one URL. Though happening of duplicates by accident won’t penalize you as such but if it becomes habit then Google won’t hesitate to do so.\nUse Dash or Hyphen instead of Underscore or Space: Search Engines deny use of underscore for words separation in URLs. Now a days use of dashes or hyphens instead of underscores is promoted. So take extra care here. Also try to avoid the spaces (use dash or hyphen for words separation; it is usually done for retaining the individual sense of words) in URL as it gives awkward look by inducing ‘%20’ for each space.\nPrefer having one root directory and sub-domain: The names of domain, subdomain, root domain, files and folders etc. in your root directory should be such that it works like a ligament in bridging user intent and your business target. According to Moz\n“A company blog is far more likely to perform well in the rankings and to help the rest of your site’s content perform well if it’s all together on one sub and root domain.”\nSo having fewer or minimum sub domains, root directory (ideally one only per website), files and folders make Search Engine to understand your content basket more pleasantly.\nAlways use lower case letters in URL naming: Along side it, there are some servers like Linux and Unix which are case sensitive. For them same words written in URLs with uppercase and lowercase letters count as different pages. For example\nhttp://www.marketingorbits.com/white-hat-on-page-seo-2017/\nand\nhttp://www.marketingorbits.com/White-Hat-On-Page-SEO-2017/\nwill be treated as two different pages. So to be with as par quality standards of Search Engines always use lower case letters in URL naming.\nMake fetching and indexing every newly created URL in Google Webmaster with redirection wherever necessary as a thumb-rule!\nSitewide Optimization:\nLet’s take the ‘web hosting services’ as your post office, your ‘website’ as your letter and ‘search engine’ as postman. As much as optimized, secure and fast this whole process would be, so will be your site brand. Along with technical things, Sitewide Optimization deals with psychological reasoning too. If this section is done deservingly it can boost up your site speed less than 4 seconds (as per google recommendations), or 3 seconds (for 100 pages website) as per Tom Dupuis of onlinemediamasters.com . Let’s talk on as such factors one by one.\n-\n- Server Configuration: Configuring your server can be understood by simple fundamental of human life. Like if you go to a meeting but person didn’t come, it shall create anxiety in you. But if the person informs you about delay or cancellation of meeting in advance let’s say via SMS; it shall not only retain your faith in him/her but also shows the sincerity of that person towards you. Same way if you set-up some flags and directives for down, blank or off states (it may happen due to technicalities both in or not your control) of your website in advance, it shall ascribe its visitors with proper reason behind. Such directives or flags can be:\n- 404 Error Page Implementation: Out of all types of server errors 404 is seen most frequently. 404 error flag tells the user that page is not available or found. Reason behind may be known to you as one of following page under maintenance, server response issue or the page was completely taken offline.\n- 301 Redirect Implementation: It helps to take all kind of fresh or old visitors of your page to modified (in case if you had to do modify it) or new address of your webpage from previous one in search of which your committed visitor had landed. It develops emotional bonding among them for your website.\n- Google Search Console Implementation: Well this is delivery vehicle of your postman talked above. Google Search Console fetches your pages and list them on SERPs. However you need an expert webmaster to use its all functionalities even though it’s not as much tougher to implement yourself. On first sign-up Google Search Console provides you with below ‘sitewide optimization activities list’:\nAdd all your website versions you want to verify like www, non-www, http, https (whichever applicable). Next select your preferred demographics if want to set any.\nSubmit your Sitemap & ROR Files so that Search Engine can easily navigate through your site structure to fetch the best available on it. Yoast SEO plugin, XML-Sitemaps.com , Google XML Sitemaps WordPress Plugin and Web Site Map are among best available Open Source Tools available to prepare your sitemap.xml and ror.xml files. ROR.xml carries your page titles and descriptions along with ‘just URLs list by sitemap.xml. ROR file describes your content to servers in more generic way. So it is always better to put both of these files at your root directory.\n- Google Crawl Errors Report: Use Google webmaster tool to know and fix all sorts of Site Errors such as DNS Errors, Server Connectivity Errors, Robots.txt fetching errors and URL Errors of both Desktop and Smartphones utilities.\n- Server Configuration: Configuring your server can be understood by simple fundamental of human life. Like if you go to a meeting but person didn’t come, it shall create anxiety in you. But if the person informs you about delay or cancellation of meeting in advance let’s say via SMS; it shall not only retain your faith in him/her but also shows the sincerity of that person towards you. Same way if you set-up some flags and directives for down, blank or off states (it may happen due to technicalities both in or not your control) of your website in advance, it shall ascribe its visitors with proper reason behind. Such directives or flags can be:\n-\n- Site Security:\n-\n- Robots.txt Creation & Submission: The Robots.txt file tells the search engine spiders what to and what not to index. It’s important that this file exists on your root directory of server, even if it’s empty. Also make sure the file doesn’t accidentally exclude important files, directories or the entire site. It helps in protecting your site from hackers.\n- HTTPs & SSL Encryption: Both HTTPs & SSL are among Google site ranking factors now a day. For a secure communication between your website and a browser use of HTTPs encryption is always no fault precaution. SSL is highly recommended for e-Commerce sites for same purpose.\n- Fence your site from Malwares: Since the times WordPress, Joomla and other similar CMSs started trending hugely, they have become the favorite target of spammers. So always check and go by Google Search Console alerts to fix and minimize such threats. Other useful tools and plugins in this regard are Sucuri and iTheme Security Plugin.\n-\n- Site Security:\n-\n- Site Speed & Responsiveness:\n- Make JavaScript & CSS Files Minimal and External: Nothing complicated in it, just take out the extra lines or code in your JS and CSS files straightaway because these serve nothing fruitful but hurdles. Same time ensure that there isn’t any unnecessary lines of code above the body text. To avoid the both hurdles externalize JavaScript and CSS codes by putting them in independent files and then link them in your HTML code just like image files; otherwise it gets in the way of Search Spiders to reach your keyword rich content faster. It shall harming noting but will reduced HTML doc size without any impact on number of HTTP requests.\n- Site should be responsive on all Devices and Browsers: Either you use pre-defined CMS themes/templates for your website or get it coded independently, for both cases make sure that it is equally compatible with and responsive on all devices such as desktop, laptops, mobile & and tablets because Google penalizes unresponsive sites since 2015 and thrashes unfriendly sites last in the SERP. Google Mobile Test is a highly useful tool to check mobile responsiveness of your website. Along with devices equally make sure that your website is compatible with all browsers like Chrome, Edge, Firefox, Safari etc.\n- Use CND & Image Compressing: To achieve the Google’s set 4 second standard as site load time, use CDN, compress images and fast hosting facilities to achieve maximum of it. As per Wikipedia Content Delivery Network or Content Distribution Network(CDN) is a geographically distributed network of proxy servers and their data centers. The goal is to distribute service spatially relative to end-users to provide high availability and high performance.\n- Site Speed & Responsiveness:\n-\n- User Friendly Menu & Text Navigation:\n- Use HTML Sitemap on your site: Whereas sitemap.xml and ror.xml communicate about your site with server, a beautifully crafted HTML Sitemap page on your site takes technically least knowledgeable users to make familiarity with major blocks of your site in one screen.\n- Tabulated Menu Navigations: helps users to engage with your site more deeply and confidently. So set all sorts of navigations such as Main Menu, Top Menu, Breadcrumbs and Footer very well tabulated, neat and clean.\n- Clear & Separate Text Navigation Blocks: It deals with the layout of your main content visible to user in forms of articles, blogs, posts etc. Very next section after this section deals with it in depth.\n- User Friendly Menu & Text Navigation:\n- Structured Data Mark-Up boosts Authenticity: Regular and fixed stuff (that’s why it is called as structured data) like your street address, phone number, privacy policy, testimonials, comments, reviews and ratings all together are like showcases of your website. Beside the prime content of your website these factors work like white wash on a home in building trust and reputation of your site. In fact, this cementing content drives users to recommend your site or blog to others. A well-managed structured Data shows up expertise and authority of your site and earns the trust for you. So needless to say that how crucial are these factors to be taken care.\nContent Structure of Article or Blog Post:\nGoogle prefers to fetch pages with distinct content structure and crawl-able text. As quality blogging is indispensable for your marketing & branding both so thinking & designing presentable content skeleton by listing the content and grouping the similar topics together before writing an article always pays off. Let’s talk in some depth on prominent content structuring aspects:\n- Search Spiders Love ‘Text Navigation Blocks’: Text units such as collective text (headings, paragraphs, sentences and phrases) and independent text (words and characters) form the basic building blocks of an article. Use of these blocks also known as ‘Text Navigation Blocks’ tell users that you are no nonsense mess-up and stuffy stud. So verify that every aspect/topic of your article is discussed in a separate paragraph with no JavaScript or Flash navigation usage that spiders can’t see. On usual classical norms text navigation of an article nominally contains of Title, Introduction, Body (Description with examples/references) and Conclusion sections; and as per recent most trend a small snippet of Author Information.\n- Content Richness is the key:\n-\n- Size and Quality of Content: decide on how much deeper a reader may dive into your article and how longer he/she may dwell on it. An article with clear message motivates a reader to read till end. The amount of words you have in an article should be balanced. Depending on topic, keyword, competition and user intent (Informational, Navigational, Transactional & Address) it can vary from 300 words to up to 3000 or even more. According to Yoast.com, minimum 300 words to 900 words can be taken as a standard word count window preferred by Search Engines. Backlinko says that longer content tends to rank significantly higher on google first page.\n- Viable use of Transition Words: Transition words in an article work like spices to food. These words keep your readers curious and provocative enough during reading. A strategic use of Transition words can build the reader fondness in reading your article multi-fold. Marieke van de Rakt at Yoast can be a good reference in this regard to know more about such words. Below are an aggregate list made out of Yoast Study, Words of Estimative Probability by Wikipedia and my experience; here it is all for your reference:\n- Coherence words – For example and, first of all, also, another, furthermore, finally, in addition\n- Conjunctive words – For example because, so, due to, while, since, therefore, thus, hence, then\n- Comparative words – For example same, less, rather, while, yet, opposite, much as, either\n- Conclusive words – For example as a result, hence, consequently, therefore, in conclusion\n- Estimative words – For example seems like, maybe, probably, almost, perhaps, possibly, certain, likely, frequent, rate\n- Emphasizing words – For example most of all, most noteworthy, especially relevant\n- Synonyms of your keywords or LSI keywords – Viable use of LSI words and synonyms of your keywords boost your quality. Read about LSI keywords in next to next section below.\n- Ordening of Article: Marieke van de Rakt emphasises on orderning of the article in following pattern:\n- Thematic (ordened on theme, aspect, topic)\n- Chronological (old to new)\n- Didactic (easy to hard)\n- Problem first then solution\nTopics, paragraphs ordened in above said manner gives a systematic presentation feel, consequently generates an impression of you being disciplined in mind of your reader.\n- What volume of Keywords to position where in your article: As signaled just above about the strategic use of synonyms of your keywords not only add qualitative value to your article but brings variety of words in it and side by side limit the boring repetition of same few words. But same time volume of keywords should fall in a ratio of 1 to 2% to total number of words in your article. Google uses the LSI (Latent Semantic Indexing) mapping to determine a page’s relevancy, thus sprinkle your page with as much as LSI words possible. LSI keywords are the words seen in user search patterns and behavior, and how one keyword is usually linked to another keyword is how LSI keywords are decided. LSIGraph.com is a recommended source of LSI Keywords Generator. AdWords Ads are another very strong source of keywords collection. Google your probable keywords and scan ads appearing alongside SERPs to choose stronger and affirmed keywords. As per recent recommendations of search engines try to include most of your keywords in first 100 to 150 words of your article.\n- Prefer single scrolling instead of using back and forward buttons: I face this problem with more than 50% of sites. Perhaps, they use back and forward buttons to avoid lengthy scrolling down, to get more clicks in traffic recording, to display more new ads with each back and forward click or to show search engines that theirs are the very busy sites. But at their readers end it proves nothing more than an headache for most of time, because users usually don’t want such interruptions more especially if your article catches their interest. Also by now you may have read above that search engines recommend long article under single scrolling, so rest I leave up to you to decide.\n- Dazzle your article with multimedia: Engaging images, videos, infographics (just like used in this article) and diagrams can reduce bounce rate and increase dwelling time on article thus site. Optimized images with target keywords inserted in it ‘Alt Text attribute’ brings higher engagement on your article.\n- Create unique and original content and avoid cut-copy-paste: Do a search to see if your content exists elsewhere on the World Wide Web and if yes then up to what extent. CopyScape.com is a highly used online tool to help you in maintaining originality of your content.\n-\n- Links Insertion and Beautification: Also called as linking, in broader sense it is also called as back linking; which further is the core gradient of Off-Page SEO. We shall read about it in detail in another article, here we concise on its relevant use in On-Page SEO. Wherever necessary use authentic and quality reference links throughout your write-up, the way as you may have noticed in this article. But don’t leverage too much links that you get carried away with it. Anchor-text on links beautifies them as catchy and clear. There are mainly three types of such links as follows:\n- Inbound Links – Links pointing to your article (website or webpage) page from other websites earn you quality votes for your website and business. Their use and beautification is not as such in your hands, but earning such links is the most crucial; that is where most of Off Page SEO comes in picture.\n- Outbound Links – Also called as external links, are the links which point to other articles (website or webpage) from your website. These links are a great mechanism to show Google that your page is a hub of quality info. Pages with outbound links outrank pages without outbound links. While adding these links add only relevant to your subject links, use “no follow” attribute wherever necessary, no link should be a broken link and don’t add links of bad sites.\n- Internal Links – Links from one page/post on your website to another page/post on your website. It improves user experience & get more search engine crawls.\nLet’s talk one more but crucial aspect of Links. There is lot of discussions happen on should inserted links (URL) be given HTML target attribute as “_blank” or “_parent”? A link added with target=”_blank” means it shall open in new tab after clicking and given a target=”_parent” shall open in same tab. Benefit of blank target is that your parent (article) page is still there, you just read the clicked (target) page in new tab, close it and you are back to your parent page; you don’t need to click on back button to return parent page just like in case of target=”_parent”. A further in detail research on this topic would be published in my upcoming articles.\n- Social Sharing Buttons work like magnet: BrightEdge says that using Social Sharing Buttons can increase your social sharing up to 700%. They work like magent in flooding your page with traffic.\n- Show quality comments received from readers to public: Whenever you get quality comments from readers, make sure that they are published for sure. Because such comments are cound as your grades.\nPsychological mapping between Article Content and Human Relevance:\nAll search engines invest a huge lump-sum on annotating and sequencing of their e-content so that they could provide the best relevance to user’s intent in their SERPs. Pertaining to this reason, search engines prefer not only highly qualitative but a content equally fit to user intent & relevance. So one can easily understand that it is just not the job of Search Engine to yield SERPs matching user intent but of content writers too. If you want first page SERPs listing for your article, you need to develop psychologically competitive & compelling content. So on one side of this psychology mapping is your article and on the other side it is your reader. Let’s understand this mapping through very interesting “Human Relevance Content Model” below:\nHuman Relevance Content Model: There are two types of factors which govern reach and impact of your content i.e. In Hand Factors and Dependent Factors. As the name in itself is self-explanatory, ‘In Hand Factors’ are the writer’s psychological creativity and ‘Dependent Factors’ are the factors which decide your content’s public acceptance.\nThough we shall talk in depth on this model in my upcoming article dedicated to it, even though here is a glancing grip on all of its factors:\nIn Hand Factors:\n- Quality of Content:\n- Expertise: Write it like a story telling by including your knowledge & experience on subject, it provides the niche required for your article.\n- Scope: Author should ask to self that does the article touches the maximum possible breadth and depth of at least one of four intents (talked above).\n- Utility: Think before writing that what kind of audience will be reading or using your content and how narrowly or broadly they will be satisfied by it.\n- Uniqueness: As talked in ‘Content Structure’ section above, writing the text with quality examples and references can stimulate you as a brand with uniqueness. As per Blog of Constant Content“Using examples to back up statements of fact can add value to your writing”The online self-improvement community of self-growth.com says that“Uniqueness is important to our society and our world”So is the unique content people likes the most to read. Simply go by it!\n- Freshness: Unmaintained/abandoned ‘old’ websites/articles or unmaintained and inaccurate/misleading content is a reason for a low E-A-T (expertise, authority and trust) rating by Google. Consistent, continued and concentrated R&D around your topic, updating this R&D in your content regularly with a clear time-stamp of ‘Last Updated’ all together provides extra edge.\n- Content Presentation: Please refer to Content Structure section above. A well-structured and beautified content wins the hearts of your readers for you.\n- Target: It is about reaching the right audience of your taste. Knowing your targeted market, language and location creates influence in your writing.\nDependent Factors:\n- Intent: As per my experience and feel gut, there are majorly four user intents i.e. navigating through a content, website, or blog; looking for a particular set of information; doing all sorts online money transactions and finding a geographic address online. Try that your article address at least one of these intents as major though it may satisfy more than one intent too; all depending upon scenario and topic.\n- Authority: It is pertained to popularity and trustworthiness of your website, which comes with time and disciplinary efforts. So you need a discrete pro-active approach and thinking. As a start-up, focusing on earning as much as possible quality backlinks can be the best policy of generating your authority.\n- Impact: It is measured by the number of citations, comments, referrals and testimony your article got from readers. So be active in monitoring and managing these factors after your article is published.\n- Search Appearance: The biggest benefit of advanced keyword planning is that you can use them in your meta tag list for appearing in organic searches, in AdWords Ads display for paid promotions. As much as you appear in organic and paid SERPs so increased will be your Click Through Rate.\nAvoidable Black Hat SEO Techniques:\nAs important could this article be till this point, so is the reading of this short but very crucial paragraph. Keyword stuffing, invisible text, doorway pages (entry-pages), adding unrelated keywords to the page content, page swapping (changing the webpage entirely after it has been ranked by search engine), and use of spam tactics can wash out all your hard work done on pattern elaborated above. Google Webmaster Guidelines and Bing Webmaster Guidelines are the best sources to know of all such practices which a sincere and serious blogger should always stay away from. If ever in doubt you can refer to SEO Guide of Google anytime.\nConclusion:\nSimple as that! Focus on your keywords first, topic can be anything but without keywords your article is an orphan. If you are able to figure out 5-10-20 keywords, your job of deciding theme of your article is almost done. Then comes the content generation around these keywords and putting the generated content in order; with it around 80% of you work is achieved. Now remains the task of publishing it online, its URL design, meta tagging, setting the target audience and then indexing it with search engines; talking in details on these aspects was what the aim of this article. I hope you would have enjoyed it! Though article became bit lengthy but in zeal of putting all possible of white hat SEO 2017 (updated) at one place is what I can assure you is achieved. Though there may be many more factors left yet, but I promise you to cover all those in my next version of this topic, that may be coming in mid of 2018; would that be ok for you?\nAnd yes please, now it is your turn to assess my work. So use the comment box below and let me know your views. I shall include all valuable points emerging as a feedback and recommendation from your views in next write-up! Cheers!", "id": "<urn:uuid:214c419b-6b54-454b-99ba-436d38ad75e7>", "metadata": {"dump": "CC-MAIN-2023-23", "url": "http://www.marketingorbits.com/white-hat-on-page-seo-2017/", "date": "2023-05-27T22:50:41Z", "file_path": "/root/dataclean/data/CC-MAIN-2023-23/segments/CC-MAIN-20230527223515-20230528013515-00000.warc.gz", "language": "en", "language_score": 0.9084795117378235, "token_count": 6656}}
{"text": "Property Description\nAs the world’s leader in Enterprise Cloud Data Management, we recognize a generational market disruption in data is underway. We are entering Data 3.0, where data powers digital transformation, and we’re prepared to help you intelligently lead—in any sector, category or niche. Informatica provides you with the foresight to become more agile, realize new growth opportunities, and create new inventions.\nContact Agent Property Details Property Type Bedrooms Bathrooms Size Floors Year Built Property Location", "id": "<urn:uuid:07afc2c1-5935-4652-87a1-968a6c93a144>", "metadata": {"dump": "CC-MAIN-2023-23", "url": "https://ar.alydata.com/properties/informatica", "date": "2023-05-27T22:46:58Z", "file_path": "/root/dataclean/data/CC-MAIN-2023-23/segments/CC-MAIN-20230527223515-20230528013515-00000.warc.gz", "language": "en", "language_score": 0.8249744772911072, "token_count": 123}}
{"text": "Full text access is free in HTML pages; however the Journal allows PDF and EPub access only to paid subscribers and members.\nTo access the article in PDF format , you should be a subscriber to Journal of Postgraduate Medicine. You can subscribe online for a year. If you are already a subscriber you can login to access the articles.\nYou could recommend your institutionís library to subscribe the journal so that you can have unrestricted access. Click here to recommend the journal.", "id": "<urn:uuid:9fb7a410-577f-4faa-9155-e6f7fb594b38>", "metadata": {"dump": "CC-MAIN-2023-23", "url": "https://www.jpgmonline.com/purchaseorSubscribe.asp?rd=article.asp?issn=0022-3859;year=2002;volume=48;issue=4;spage=322;epage=6;aulast=Mathew;type=2", "date": "2023-05-27T23:29:48Z", "file_path": "/root/dataclean/data/CC-MAIN-2023-23/segments/CC-MAIN-20230527223515-20230528013515-00000.warc.gz", "language": "en", "language_score": 0.8693885207176208, "token_count": 95}}
